"""Завдання 1. Реалізувати функцію caching_fibonacci, яка створює та використовує 
кеш для зберігання і повторного використання вже обчислених значень чисел Фібоначчі.
Якщо число вже знаходиться у кеші, функція має повертати значення з кешу.
Якщо число не знаходиться у кеші, функція має обчислити його, зберегти у кеш та повернути результат.
Використання рекурсії для обчислення чисел Фібоначчі.
"""
from time import perf_counter
from typing import Callable

def caching_fibonacci(func: Callable) -> int:
    """Функція-декоратор для кешування рекурсивно отриманих значень основної функції.
    Функція викорстовує словник для зберігання отриманих значень, де ключем виступає аргумент основної функції,
    а значення - результат виконання основної функції."""

    cache_dict = {}
    def wrapper(*args) -> Callable:
        cache_key = args 
        if cache_key not in cache_dict:
            cache_dict[cache_key] = func(*args)
        return cache_dict[cache_key]
    return wrapper


def fib_without_cache(n: int) ->int:
    """Функція повертає число послідовності Фібоначчі, що відповідає його порядковому номеру, 
    переданому у якості параметра функції."""

    if n < 2:
        return n
    return fib_without_cache(n - 1) + fib_without_cache(n - 2)


@caching_fibonacci
def fib(n: int) ->int:
    """Функція повертає число послідовності Фібоначчі, що відповідає його порядковому номеру, 
    переданому у якості параметра функції. До функції додається декоратор кешування, що сприяє 
    швидшому обрахунку результата."""

    if n < 2:
        return n
    return fib(n - 1) + fib(n - 2)


num = int(input("Введіть порядковий номер, для якого потрібно отримати чсло Фібоначчі: "))
#виклик функції з кешем
start_time = perf_counter()
print(f"{num} число Фібоначчі:", fib(num))
end_time = perf_counter() - start_time

#виклик функції без кешу
start_time1 = perf_counter()
print(f"{num} число Фібоначчі:", fib_without_cache(num))
end_time1 = perf_counter() - start_time1

#час виконання функції з кешем, функції без кешу та їх різниця
print(f"""Функція з кешем завершила своє виконання за {end_time} секунд.
Функція без кеша завершила своє виконання за {end_time1} секунд.
Функція з кешем швидша на {end_time1 - end_time} секунд""")

